1. Напишите программу, которая считывает символы с клавиатуры до тех пор, пока не встретится точка.
Предусмотрите в программе счетчик пробелов. Сведения о количестве пробелов должны выводиться в конце программы.
Ответ:      WhileDontDot.java

2. Каков общий синтаксис многоступенчатой конструкции i f - e l s e - i f ?
if (condition) expression1;
else if (condition) expression2;
else expression3;

3. Допустим, имеется следующий фрагмент кода.
if (х < 10)
    if (у > 100) {
        if(!done) х = z;
        else у = z;
    }
else System.out.println("error");// к какой инструкции i f относится?
С какой из инструкций i f связана последняя ветвь e l s e ?
Ответ:      к (x < 10)

4. Напишите цикл f o r, в котором перебирались бы значения от 1000 до 0 с шагом 2.
Ответ:      for (int i = 1000; i <= 0; i -= 2)

5. Корректен ли следующий фрагмент кода?
for (int i = 0; i < num; i++)
    sum += i;
count = i;
Ответ:      нет, i не существует в области видимости переменной count; sum и num возможно не проинициализированы выше.

6. Какие действия выполняет инструкция break? Опишите оба варианта этой инструкции.
Ответ:      позволяет прервать итерацию цикла и выйти из него; возможен выход к указанной точке (типа goto).

7. Какое сообщение будет выведено после выполнения инструкции b r e a k в приведенном ниже фрагменте кода?
for(i = 0; i < 10; i++) {
    while(running) {
        if(x<y) break;
        // ...
    }
    System.out.println("После while");
}
System.out.println("После for") ;
Ответ:      ошибка, так как i не объявлена.

8. Что будет выведено на экран в результате выполнения следующего фрагмента кода?
for(int i = 0; i<10; i++) {
    System.out.print(i + " ");
    if((i%2) == 0) continue;
    System.out.println() ;
}
Ответ:
0 1
2 3
4 5
6 7
8 9


9. Итерационное выражение для цикла f o r не обязательно должно изменять переменную цикла на фиксированную величину.
Эта переменная может принимать произвольные значения. Напишите программу, использующую цикл f o r для вывода чисел
в геометрической прогрессии: 1, 2, 4, 8, 16, 32 и т.д.
Ответ:      for (int i = 1; ; i *= 2) System.out.println(i);

10. Коды ASCII-символов нижнего регистра отличается от кодов соответствующих символов верхнего регистра на величину 32.
Следовательно, для преобразования строчной буквы в прописную нужно уменьшить ее код на 32.
Используйте это обстоятельство для написания программы, читающей символы с клавиатуры.
При выводе результатов данная программа должна преобразовывать строчные буквы в прописные, а прописные — в строчные.
Остальные символы не должны меняться. Работа программы должна завершаться после того, как пользователь введет
с клавиатуры точку. И наконец, сделайте так, чтобы программа отображала количество символов, для которых был изменен регистр.
Ответ:      CaseChange.java

11. Что такое бесконечный цикл?
Ответ:      цикл, у которого отсутствует условие завершения.

12. Должна ли метка, используемая вместе с инструкцией b r e a k, быть определена в блоке кода, содержащем эту инструкцию?
Ответ:      нет.
